backend/app/models/business.rb

  def averageReview

  count = 0
  total = 0
  self.reviews.each do  |review|
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."business_id" = ?  [["business_id", 1]]