backend/app/controllers/businesses_controller.rb

    def index
        businesses = Business.all
---
SELECT "businesses".* FROM "businesses"

    def reviews
        reviews = Review.where(id: params["id"])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."business_id" = ?  [["business_id", 1]]

    def create_review
        review = Review.new(user_id: params["currentUser"], business_id: params["currentBusiness"], message: params["formValue"], rating: params["ratingValue"])
        review.save
        business = Business.find(params["currentBusiness"])
        business.update(avg_review: business.averageReview)
---
INSERT INTO "reviews" ("user_id", "business_id", "message", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["business_id", 1], ["message", "wewewe"], ["rating", 5], ["created_at", "2020-05-17 22:22:03.150007"], ["updated_at", "2020-05-17 22:22:03.150007"]]
SELECT "businesses".* FROM "businesses" WHERE "businesses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "businesses" SET "avg_review" = ?, "updated_at" = ? WHERE "businesses"."id" = ?  [["avg_review", 5.0], ["updated_at", "2020-05-18 01:25:22.756582"], ["id", 1]]