backend/app/controllers/reviews_controller.rb

    def create_review
        review = Review.new(user_id: params["currentUser"], business_id: params["currentBusiness"], message: params["formValue"], rating: params["ratingValue"])
        review.save
        business = Business.find(params["currentBusiness"])
---
INSERT INTO "reviews" ("user_id", "business_id", "message", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["business_id", 1], ["message", "Great camp"], ["rating", 5], ["created_at", "2020-05-17 04:52:25.038152"], ["updated_at", "2020-05-17 04:52:25.038152"]]
SELECT "businesses".* FROM "businesses" WHERE "businesses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]