backend/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "test"], ["LIMIT", 1]]
---
  def login
    user = User.find_by(email: params["email"])

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "ben@gmail.com"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create_account
    user = User.find_by(email: params["email"])
    if (user != nil)
      render json: { error: "A user already has an account with this email" }, status: :unauthorized
    else
      user = User.new(email: params["email"], password: params["password"])
      user.save