backend/app/serializers/business_serializer.rb

  def reviews

      array = []
    reviews = Review.where(business_id: self.object.id)
    reviews.each do |review|
      obj = {
        review: review,
        user: User.find_by(id: review.user_id)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."business_id" = ?  [["business_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]